def format_price(price):
    return f"{price:.2f} грн"

# створюємо словник з товарами: назва (ціна, наявність)
store = {
    "сир": (30, True),
    "ковбаса": (65, True),
    "хліб": (20, False),
    "масло": (45, True)
}
# функція, яка рахує суму замовлення
def calculate_price(order):
    total = 0     # створюємо змінну для підрахунку ціни
    for item in order:    # перебираємо всі товари у замовленні
        total += store[item][0]     # додаємо ціну кожного товар
    print("Ціна:", format_price(total))   # виводимо загальну ціну


# функція, яка перевіряє наявність товарів
def check_availability(order):
    for item in order:
        if item in store:
            available = store[item][1]   # True або False
            print(f"{item} — {available}")
        else:
            print(f"{item} — немає такого товару")

# головна функція програми
def main():
    print("Ласкаво просимо до магазину!")   # привітання користувача

    while True:
        print("Доступні товари:", ", ".join(store.keys()))  # показуємо список товарів
        user_input = input("Введіть товари через кому або '.': ").lower()  # вводимо замовлення

        if user_input == ".":
            print("Дякуємо за візит!")
            break

        order = []                          # список замовлених товарів
        for item in user_input.split(","):  # розділяємо введене по комах
            item = item.strip()             # забираємо пробіли
            if item in store:               # перевіряємо, чи є такий товар у магазині
                order.append(item)          # додаємо його до замовлення

        if not order:                       # якщо список замовлення пустий
            print("Неправильний вибір товарів")
            continue                        # переходимо на початок циклу

        if not check_availability(order):                  # перевіряємо наявність товарів
            print("Деяких товарів немає")
            continue                        # переходимо на початок циклу

        action = input("Введіть дію: (переглянути ціну або купити): ").strip() # вибір дії

        if action == "переглянути ціну":    # якщо користувач хоче переглянути ціну
            calculate_price(order)                      # рахуємо і показуємо вартість
            buy = input("Хочете купити? (так/ні): ")  # питаємо, чи купувати
            if buy == "так":
                print("Замовлення оформлено")   # підтверджуємо замовлення
        elif action == "купити":            # якщо одразу "купити"
            print("Замовлення оформлено")   # підтверджуємо замовлення
        else:                               # якщо написав щось інше
            print("Невідома дія")           # кажемо, що такої дії нема

# стандартна конструкція запуску програми
if __name__ == "__main__":
    main()
# запускаємо головну функцію
